In [1]:
'!pip install ipython-sql'

'!pip install ipython-sql'

In [2]:
%load_ext autoreload
%autoreload 2

%load_ext sql

In [3]:
%sql postgresql://postgres:ali123ali@127.0.0.1/youtubedb

In [4]:
%sql SELECT * FROM Videoplay_fact LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[(1, datetime.datetime(2018, 11, 14, 5, 6, 3, 796000), '10', 'free', 'SOGDBUF12A8C140FAA', 'AR558FS1187FB45658', '484', 'Washington-Arlington-Alexandria, DC-VA-MD-WV', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (2, datetime.datetime(2018, 11, 19, 9, 14, 20, 796000), '24', 'paid', 'SOGDBUF12A8C140FAA', 'AR558FS1187FB45658', '672', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 27, 22, 35, 59, 796000), '80', 'paid', 'SOGDBUF12A8C140FAA', 'AR558FS1187FB45658', '992', 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 14, 5, 6, 3, 796000), '10', 'free', 'SOGDBUF12A8C140FAA', 'AR558FS1187FB45658', '484', 'Washington-Arlington-Alexandria, DC-VA-MD-WV', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (6, datetime.datetime(2018, 11, 19, 9, 14, 20, 796000), '24', 'paid', 'SOGDBUF12A8C140FAA', 'AR558FS1187FB45658', '672', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [5]:
%sql SELECT * FROM Users_dim LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[('8', 'Kaylee', 'Summers', 'F', 'free'),
 ('10', 'Sylvie', 'Cruz', 'F', 'free'),
 ('26', 'Ryan', 'Smith', 'M', 'free'),
 ('101', 'Jayden', 'Fox', 'M', 'free'),
 ('53', 'Celeste', 'Williams', 'F', 'free')]

In [6]:
%sql SELECT * FROM Videos_dim Limit 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', '0', '218.93179'),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', '1969', '148.03546'),
 ('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', '0', '177.47546'),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', '1982', '233.40363'),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', '2007', '209.60608')]

In [7]:
%sql SELECT * FROM Youtubers_dim LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', 'NaN', 'NaN'),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', '35.14968', '-90.04892'),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', 'NaN', 'NaN'),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', 'NaN', 'NaN'),
 ('ARXR32B1187FB57099', 'Gob', '', 'NaN', 'NaN')]

In [8]:
%sql SELECT * FROM Time_dim LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[(datetime.datetime(2018, 11, 1, 21, 1, 46, 796000), '21', '1', '44', '11', '2018', '3'),
 (datetime.datetime(2018, 11, 1, 21, 5, 52, 796000), '21', '1', '44', '11', '2018', '3'),
 (datetime.datetime(2018, 11, 1, 21, 8, 16, 796000), '21', '1', '44', '11', '2018', '3'),
 (datetime.datetime(2018, 11, 1, 21, 11, 13, 796000), '21', '1', '44', '11', '2018', '3'),
 (datetime.datetime(2018, 11, 1, 21, 17, 33, 796000), '21', '1', '44', '11', '2018', '3')]

## REMEMBER: Restart this notebook to close connection to `youtubedb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `extract_transform_load.py`, or `extract_transform_load.ipynb` files since you can't make multiple connections to the same database (in this case, youtubedb).